* Check services
Once you've applied the manifests by committing the tangled files, check the
operator is running:

#+begin_src shell :noweb yes :eval never-export :exports code :results output
<<kubectl>> -n rook-nfs-system get all
#+end_src

#+RESULTS:
: NAME                                     READY   STATUS    RESTARTS   AGE
: pod/rook-nfs-operator-6cdc448676-x28rr   1/1     Running   0          107m
: 
: NAME                                READY   UP-TO-DATE   AVAILABLE   AGE
: deployment.apps/rook-nfs-operator   1/1     1            1           107m
: 
: NAME                                           DESIRED   CURRENT   READY   AGE
: replicaset.apps/rook-nfs-operator-6cdc448676   1         1         1       107m

And check the nfs server is running:

#+begin_src shell :noweb yes :eval never-export :exports code :results output
<<kubectl>> -n rook-nfs get all
#+end_src

#+RESULTS:
: NAME             READY   STATUS    RESTARTS   AGE
: pod/rook-nfs-0   2/2     Running   0          11m
: 
: NAME               TYPE        CLUSTER-IP      EXTERNAL-IP   PORT(S)            AGE
: service/rook-nfs   ClusterIP   10.43.190.169   <none>        2049/TCP,111/TCP   11m
: 
: NAME                        READY   AGE
: statefulset.apps/rook-nfs   1/1     11m

